#ifndef _ACTION_HANDLER
#define _ACTION_HANDLER

#include "guiserv.h"
/*****************************************************************
 *   Модуль обробки подій користувачем бібліотеки                *
 * Кістяк файлу реалізації генерується компілятором ресурсів     *
 * Інтерфейс програмування у такій системі низькорівневий,       *
 * це означає, що треба досконало знати, для чого використо-     *
 * вується та чи інша змінна, які можуть бути побічні            *
 * ефекти у певної функції                                       *
 *****************************************************************/

/*****************************************************************
 *  Викликається сервером щоразу, коли відбулася якась подія     *
 * Для реалізації бажаної функціональності треба аналізувати     *
 * поля структур Item та Event. Крым того, вказівник на потрібний*
 * елемент інтерфейсу можна отримати з його ідентифікатора, ви-  *
 * користовуючи макрос GET_ITEM_WITH_ID(ItemID)                  *
 *****************************************************************/
void ActionPerformed(const struct CGUIConstItem *Item, 
					 const struct CEventDescriptor *Event);

#endif
