#ifndef _DIALOG
#define _DIALOG

#include "iface.h"

/*************************************************
 *  Модуль роботи з контейнером верхнього рівня, *
 *  який має функціональність діалогового вікна  *
 *************************************************/

void DrawDialog(const struct CGUIConstItem *Dialog);

/*****************************************************************************
 *    Зберегти поточний активний діалог у стеку діалогів                     *
 * повертає 1 у випадку удачі, інакше -- 0                                   *
 *****************************************************************************/
int StoreActiveDialogInStack(void);

/*****************************************************************************
 *    Відновити активний діалог зі сетку діалогів                            *
 * повертає 1 у випадку удачі, інакше -- 0                                   *
 *****************************************************************************/
int RestoreActiveDialogFromStack(void);

void MakeDialogActive(const struct CGUIConstItem *Dialog);

#endif
