#ifndef _TAB_CONTROL
#define _TAB_CONTROL

/***************************************************************
 *	Робота з контейнером, що називається "Закладки"            *
 * Ці функції використовуються сервером, тобто користувачеві   *
 * навіть не треба сюди зазирати                               *
 ***************************************************************/

#include "guiserv.h"
#include "iface.h"

/***************************************************************
 * Функція відображає закладки на екрані, виходячи з даних,    *
 * що розміщені в ConstDeskTop[]                               *
 ***************************************************************/
int DrawTabControl(const struct CGUIConstItem *TabControl);

/*******************************************************************
 *  Кожен контейнер повинен мати функцію взяття елемента за його   *
 *  екранними координатами                                         *
 *  Повернення 0 у викликаючу функцію сигналізує про те, що пошук  *
 *  треба продовжити з елемента *Item, одиниця ж показує, що бажа- *
 *  ний елемент знаходиться за адресою *Item                       *
 *******************************************************************/
int GetTabControlItem(unsigned int x, unsigned int y,
						const struct CGUIConstItem **Item);

/********************************************************************
 *   Контейнер не можна виділити цілком, проте його певна частина   *
 * може мати таку властивість. У даному випадку йдеться про         *
 * закладку Tab                                                     *
 ********************************************************************/
void SelectTab(const struct CGUIConstItem *Tab);

#endif
